UNF_KlK.КИТ_ДОК/src/Documents/ПриходныйОрдерНаКруглыйЛесоматериал/ПриходныйОрдерНаКруглыйЛесоматериал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйОрдерНаКруглыйЛесоматериал</name>
  <registerRecords>AccumulationRegister.ДвижениеПоПроизводству</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БезПраваПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Погрузка</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.ТС_Перевозчики_KIT</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.ПунктыПогрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредъявлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СубПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтукПредъявлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеСертификата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.УчасткиПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредъявленоСосна</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредъявленоЕль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаПоставщиком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУчетаЛесногоФонда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтвественноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаНЗП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредъявленоОсина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредъявленоБереза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредъявленоХвоя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредъявленоЛиственница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредъявленоПихта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобственныйПиловочник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаскатки</name>
    <type>
      <types>EnumRef.ВидыРаскатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходныйОрдер</name>
    <type>
      <types>DocumentRef.ПриходныйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>Раскатка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПачек</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Диаметр</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаПачки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаПачки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВысотаПачки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффицентДревесности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.ШтабелиKIT</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоправочныйКоэффицент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамерыРучнойУчет</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Диаметр</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.ШтабелиKIT</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтукБрак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураБрак</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБрак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNF_KlK.КИТ_ДОК/src/Documents/ПриходныйОрдерНаКруглыйЛесоматериал/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если обменданными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПриходныйОрдер) Тогда
		 ДокОбъект = Документы.ПриходныйОрдер.СоздатьДокумент(); 
		 ДокОбъект.Дата =  Дата;  
		 ДокОбъект.Организация =  Организация; 
		 Докобъект.Записать(режимзаписидокумента.Запись);
		 ПриходныйОрдер = Докобъект.Ссылка;
	 КонецЕсли;
	 ДокОбъект = ПриходныйОрдер.ПолучитьОбъект();
	 ДокОбъект.Дата =  Дата; 
	 ДокОбъект.Автор = Пользователи.ТекущийПользователь();
	 ДокОбъект.Организация =  Организация; 
	 ДокОбъект.СтруктурнаяЕдиница =  Склад; 
	 ДокОбъект.Контрагент =  Контрагент; 
	 ДокОбъект.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ПриходныйОрдер; 
	 ДокОбъект.Запасы.Очистить();
	Если ЗамерыРучнойУчет.количество() > 0 Тогда
		Для Каждого СтрокаТовары Из ЗамерыРучнойУчет Цикл
			СтрЗапасы = ДокОбъект.Запасы.Добавить();
			СтрЗапасы.Номенклатура = СтрокаТовары.Номенклатура;
			СтрЗапасы.Количество = СтрокаТовары.Количество;
			СтрЗапасы.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаИзмерения;
			СтрЗапасы.Характеристика = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиКруглогоЛесоматериала(
			СтрокаТовары.Диаметр, СтрокаТовары.Порода, СтрокаТовары.Длина, СтрокаТовары.Номенклатура);
			
			Если СтрокаТовары.КоличествоШтукБрак > 0 Тогда
				СтрЗапасы = ДокОбъект.Запасы.Добавить();
				СтрЗапасы.Номенклатура = СтрокаТовары.НоменклатураБрак;
				СтрЗапасы.Количество = СтрокаТовары.КоличествоБрак;
				СтрЗапасы.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТовары Из ДанныеПачек Цикл
			СтрЗапасы = ДокОбъект.Запасы.Добавить();
			СтрЗапасы.Номенклатура = СтрокаТовары.Номенклатура;
			СтрЗапасы.Количество = СтрокаТовары.Количество;
			СтрЗапасы.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаИзмерения;
			СтрЗапасы.Характеристика = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиКруглогоЛесоматериала(
			СтрокаТовары.Диаметр, СтрокаТовары.Порода, СтрокаТовары.ДлинаПачки, СтрокаТовары.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	 ДокОбъект.Записать(режимзаписидокумента.Запись);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДокОбъект = ПриходныйОрдер.ПолучитьОбъект();  
	ДокОбъект.Записать(режимзаписидокумента.Проведение);
	ЛокализацияДанныхПроизводство.ПроведениеПоДвижениюПроизводства(Движения, Ссылка,Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ДокОбъект = ПриходныйОрдер.ПолучитьОбъект();  
	ДокОбъект.Записать(режимзаписидокумента.ОтменаПроведения);
КонецПроцедуры
